number_1 = 5
number_2 = 3

""" Задание 1"""
# if (number_1 % 2) == 0:
#     print("Привет!")
# else:
#     print("Пока!")

""" Задание 2"""
# if (number_1 // 2) == 2:
#     print("Привет!")
# else:
#     print("Пока!")

""" Задание 3"""
# if number_1 > 10:
#     print("Привет!")
# elif number_1 > number_2:
#     print("Как дела?")
# else:
#     print("Пока!")

""" Задание 4"""
# number_3 = input("Введите число")
# if number_3 > 50:
#     print("Белый")
# elif number_3 >= 20:
#     if number_3 < 30:
#         print("Жёлтый")
#     else:
#         print("Красный")
# else:
#     print("Чёрный")
