"""
Два целых числа a и b вводятся с клавиатуры (a < b).
Разработайте скрипт, выводящий на экран все четные числа из интервала [a, b]
(Примечание: числа a и b вводятся с клавиатуры в одной строке)
Пример выполнения скрипта:
     Программа вывода четных чисел
     Введите два числа -> 1 10
     2 4 6 8 10
"""


"""
Дано целое число в диапазоне 1 - 9999. 
Разработайте скрипт, выводящий описание этого числа вида "четное двузначное число", "нечетное четырехзначное число" и т.п.
Пример выполнения скрипта:
     Программа определения числа
     Введите число -> 322
     четное трехзначное число
"""
